import { Injectable } from '@angular/core';
import { Http } from '@angular/http';
import 'rxjs/add/operator/map';

@Injectable()
export class BookDataProvider {

	private longText: string;
	private index: number;

	constructor(public http: Http) {

		// TODO: load from storage & network
		this.longText = `【陈其泰：贾雨村(风尘怀)[咏歌兆]闺秀：怀闺秀未合书中所叙情节。】【王希廉：开卷第一回是一段，而第一段之中又分三小段。自第一句起，至“提醒阅者之意”句止为第一段，说亲见盛衰，因而作书之意。自“看官你道”句起，至“看官请听”句止为第二段，是代石头说一生亲历境界，实叙其事，并非捏造，以见“空即是色，色即是空”之意。故借空空道人抄写得来。自“按那石上书云”句起至末为第三段，提出“真”“假”二字。以甄士隐之梦境出家引起宝玉，以英莲引起十二金钗，以贾雨村引起全部叙述。 石高十二丈，四方二十四丈，按周年十二月二十四气。三万六千五百一块，按周天三百六十五度四分度之一之数。 情僧者，情生也；情僧缘者，因情生缘也。风月宝鉴者，即因色悟空也。金陵十二钗，情缘之所由生也。 “石头记”者，缘宁、荣二府在石头城内也。悼红轩似即怡红院故址，当是曹雪芹先生曩日目击怡红院之繁华，乃十年之后重游故地，风景宛然，而物换星移，园非故主，院亦改观，不禁有满目河山之感，故题其轩曰“悼红”，以见鸟啼花落，无非不悼。此一把酸辛泪，不由人不落也。葫芦庙有二义：葫芦虽小，其中日月甚长，可以藏三千大千世界，寓此书虽是小说，而包罗万象，悲欢离合，盛衰善恶，有无数感慨劝惩：此一义也。此书虽是荒唐，却是实录其事，并非捏造，所谓依样葫芦：此又一义也。故甄士隐必住庙旁，贾雨村必住庙内。或曰：“尚有一义。”余问：“何义？”答曰：“葫芦音同胡卢。人生若梦，幻境皆虚，离合盛衰，生老病死，不过如泡影电光。书虽实录其事，而隐藏真迹，假托姓名，演为小说，以供胡卢一笑耳：此亦一义也。”所说亦有意味，因附记之。 贾雨村口吟“玉在椟中”一联，暗伏黛玉、宝钗二人。 《跛足道人歌》，及甄士隐注解是一部《红楼梦》影子。 甄士隐向跛足道人说“走罢”，即“不回家”，直伏一百十九回宝玉之一走。】【张新之：自此回至四回，为一大段，乃全书总冒。此回又本段之总冒。一真一假，太极分判，森罗万象，从此而起。 石头是人、是心、是性、是天、是明德。曰“通灵”，即虚灵不昧也，惟一真能识之。故上半云“识”。情是物欲；是污染。曰“风尘”，即所拘所蔽，而中藏皆假也。故下半曰“怀”一真一假，开手举出，谓非性理之书，吾不信。 此回如子母连环，阵声相对，一头二臂二足：《石头记》缘起以前总冒也，为一头；下入真、假二传，为二臂；二传既毕，复以失女、出家，找足“识通灵”，为一足；以买线遇官，找足“怀闺秀”，为一足。合具全体，纾荣联格，已见大观。】【姚燮：还泪之说甚奇。然天下之情，至不可解处，即还泪亦不足以极其缠绵固结之情也。书中林黛玉，自是可人，泪一日不还，黛玉尚在，泪既枯，黛玉亦物化矣。 神瑛与绛珠，一草一石，所谓木石缘也。人皆重金玉而贱木石，岂天意亦与为转移耶？ 《好了歌》醒世最为晓畅。惜恒河沙中，绝少领悟人。 卷首士隐出家，卷末宝玉出家，却是全部书底面盖，前后对照。 此时雨村在穷困中，犹不失读书人本色。不知后来一入仕途，且居显要，便换一副面目肺肠，诚何故也，然今日已成为通病矣。 此回写士隐之依丈人者，为全书中如黛玉之依外祖母、薛氏母女之依姊妹，邢岫烟之依姑母，李婶母女之依侄女，尤氏母女之依女婿等，以见依人者之必无好收成也。若豪仆如周、林等，宠婢如鸳、琥等，门客如詹、王等，(犹)[尤]其下焉者耳。】 此开卷第一回也。【刘履芬眉批：现身说法，借他人酒，浇自己块垒。】作者自云：【黄小田夹批：细读全书宝玉亦作者也。】历过一番梦幻之后，故将真事隐去，而借“通灵”，说此《石头记》一书也。故曰“甄士隐”云云。【东观阁（姚燮）侧批：现身说法，是开卷大宗旨。】但书中所记何事、何人？自己又云：“今风尘碌碌，一事无成，忽念及当日所有之女子，【陈其泰：非书本意。】一一细考较去，觉其行止见识皆出我之上。我堂堂须眉，诚不若彼裙钗？我实愧则有馀，悔又无益之大无可如何之日也！当此日，欲将已往所赖天恩祖德，锦衣纨绔之时，饫甘餍肥之日，背父兄教育之恩，负师友规训之德，【黄小田夹批：即作者自道，无疑。】以至今日一技无成，半生潦倒之罪，编述一集，以告天下知：我之负罪固多，然闺阁中历历有人，万不可因我之不肖，自护己短，一并使其泯灭也。故当此蓬牖茅椽，绳床瓦灶，未足妨我襟怀况对着晨风夕月，阶柳庭花，更觉润人笔墨。虽我不学无文，又何妨用假语村言，敷演出来，亦可使闺阁昭传，复可破一时之闷，醒同人之目，不亦宜乎？”故曰“贾雨村”云云。【东观阁侧批（姚燮眉批）：真事[隐]去，而用假语村言敷衍之（出来），故先叙此两人。】更于篇中间用“梦”、“幻”等字，却是此书本旨，兼寓提醒阅者之意。 看官：你道此书从何而起？说来虽近荒唐，细玩深有趣味。【姚燮夹批：以上为全书总纲。】 却说那女娲氏炼石补天之时，于大荒山无稽崖炼成高十二丈，见方二十四丈的顽石三万六千五百零一块。那娲皇只用了三万六千五百块，只单单剩了一块未用，弃在青埂峰下。谁知此石自经煅炼之后，灵性已通，自去自来，可大可小。因见众石俱得补天，【黄小田夹批：不得黛玉，此恨难补。故以己身为为未与补天之石。】独自己无材不得入选，【东观阁侧批：石头根底，大有来历，叙述具有妙谛。】【姚燮侧批：叙出根底来历，大有妙谛。】遂自怨自愧，日夜悲哀。一日，正当嗟悼之际，俄见一僧一道远远而来，【东观阁侧批：一僧一道是（姚燮侧批：）此书枢纽。】生得骨格不凡，丰神迥异，来到这青埂峰下，席地坐谈。见这块鲜莹明洁的石头，且又缩成扇坠一般，甚属可爱。那僧托于掌上，笑道：“形体倒也是个灵物了！还只没有实在的好处，须得再镌上数字，【陈其泰：调侃不小。】【张新之夹批：实在好处再镌上几个字，乃“莫失莫忘”也。其下语则效验，谓非心而何？】使人人见了便知你是件奇物。然后携你到那昌明隆盛之邦，诗礼簪缨之族，花柳繁华地，温柔富贵乡去走一遭。”石头听了大喜，因问：“不知可镌何字，携到何方？望乞明示。”那僧笑道：“你且莫问，日后自然明白的。”说毕，便袖了，同那道人飘然而去，竟不知投向何方。 又不知过了几世几劫，因有个空空道人【张新之夹批：空空道人作者自谓也，故直曰情僧录。】访道求仙，从这大荒山无稽崖青埂峰下经过，忽见一大块石上字迹分明，编述历历。空空道人乃从头一看，原来是无材补天，幻形入世，被那茫茫大士、渺渺真人携入红尘，引登彼岸的一块顽石。上面叙着堕落之乡，投胎之处，以及家庭琐事，闺阁闲情，诗词谜语，倒还全备，只是朝代年纪失落无考。【东观阁（姚燮）侧批：起此一段，已将全数大旨揭明，非他小说可比。】后面又有一首偈云： 无材可去补苍天，枉入红尘若许年。 此系身前身后事，倩谁记去作奇传？ 空空道人看了一回，晓得这石头有些来历，遂向石头说道：“石兄，你这一段故事，据你自己说有些趣味，故编写在此，意欲闻世传奇。据我看来，第一件，无朝代年纪可考；第二件，并无大贤大忠理朝廷治风俗的善政，其中只不过几个异样女子，或情或痴，或小才微善，我总然抄去，也算不得一种奇书。”石头果然答道：“我师何必太痴？我想历来野史的朝代，无非假借汉唐的名色；莫如我这石头所记，不借此套，只按自己的事体情理，反倒新鲜别致。况且那野史中，或讪谤君相，或贬人妻女，奸淫凶恶，不可胜数；更有一种风月笔墨，其淫秽污臭，最易坏人子弟；至于才子佳人等书，则又开口文君，满篇子建，千部一腔，千人一面，且终不能不涉淫滥；在作者不过要写出自己的情诗艳赋来，故假捏出男女二人名姓，又必旁添一小人拨乱其间，如戏中小丑一般；更可厌者，“之乎者也”，非理即文，大不近情，自相矛盾，竟不如这半世亲见亲闻的几个女子，虽不敢说强似前代书中所有之人，但观其事迹原委，亦可消愁破闷；至于几首歪诗，亦可以喷饭供酒。其间离合悲欢、兴衰际遇，俱是按迹循踪，不敢稍加穿凿，至失其真。只愿世人当那醉余睡醒之时，或避世消愁之际，把此一玩，不但是洗旧翻新，却也省了些寿命筋力，不更去谋虚逐妄了。我师意为如何？”【陈其泰：一路说至此，知此书是作书者自述也，提醒。】 空空道人听如此说，思忖半晌，将这《石头记》再检阅一遍，因见上面大旨不过谈情，亦只是实录其事，并无伤时悔淫之病，方从头至尾抄写回来闻世传奇。从此空空道人因空见色，由色生情，传情入色，自色悟空，【姚燮侧批：十六字可包三藏，全部真是（东观阁侧批：）微词妙谛。】【陈其泰：一部红楼梦读法尽此十六字，即尽此一“情”字。】【黄小田夹批：此四句是宝玉赞语，情僧即宝玉，亦即作者自号。】遂易名为情僧，改《石头记》为《情僧录》。东鲁孔梅溪则题曰《风月宝鉴》。后因曹雪芹于悼红轩中披阅十载，增删五次，纂成目录，分出章回，则题曰《金陵十二钗》。并题一绝云： 满纸荒唐言，一把辛酸泪！ 都云作者痴，谁解其中味？【刘履芬眉批：悼红轩似是怡红院旧址。】 出则既明，且看石上是何故事。按那石上书云：【姚燮侧批：以上是此书缘起，（东观阁侧批：）说来有根有据。】 当日地陷东南，【姚燮眉批：天地尚有缺陷何况于人？只此“地陷东南”四字已为全书立表。】【黄小田夹批：“地陷东南”，即前天不能补之意。故黛玉生于此乡】这东南一隅有处曰姑苏，有城曰阊门者，最是红尘中一二等富贵风流之地。这阊门外有个十里街，街内有个仁清巷，巷内有个古庙，因地方窄狭，人皆呼作葫芦庙。【东观阁侧批：葫芦庙皆隐语。】【姚燮侧批：隐语亦是显语，全书作如是观。】【张新之夹批：无极而太极，太极而两仪，便是葫芦。葫芦既判，人事出矣，真假分矣。此皇古一大妙也。】庙旁住着一家乡宦，姓甄，名费，字士隐。嫡妻封氏，情性贤淑，深明礼义。家中虽不甚富贵，然本地便也推他为望族了。因这甄士隐禀性恬淡，不以功名为念，每日只以观花修竹、酌酒吟诗为乐，倒是神仙一流人品。只是一件不足：如今年已半百，膝下无儿，只有一女，乳名唤作英莲，年方三岁。一日，炎夏永昼，士隐于书房闲坐，【姚燮眉批：此书全部时令从炎夏永昼起，以雪天贾政遇宝玉止，始于热，终于冷，天时，人事默相吻合，作者之心意也。】至手倦抛书，伏几少憩，不觉朦胧睡去。梦至一处，不辨是何地方。忽见那厢来了一僧一道，且行且谈。 只听道人问道：“你携了这蠢物，意欲何往？”那僧笑道：“你放心，【张新之夹批：三字起的突兀，为梦幻中第一言。通部人无非放心者，无非不放心者。故后文宝玉以此三字告黛玉以结此案。】如今现有一段风流公案正该了结，这一干风流冤家，尚未投胎入世。趁此机会，就将此蠢物夹带于中，使他去经历经历。”那道人道：“原来近日风流冤孽又将造劫历世去不成？但不知落于何方何处？”那僧笑道：“此事说来好笑，只因当年这个石头，娲皇未用，自己却也落得逍遥自在，各处去游玩；一日，来到警幻仙子处，【东观阁（姚燮）侧批：微旨。】那仙子知他有些来历，因留他在赤霞宫中，名他为赤霞宫神瑛侍者。他却常在西方灵河岸上行走，看见那灵河岸上三生石畔有棵绛珠仙草，【张新之夹批：绛为心之色，珠为心之慧，一草一石为书之主，一金一玉为书之实，千头万绪不外乎此。】【东观阁（姚燮）侧批：非此地必不能生此草。】十分娇娜可爱，遂日以甘露灌溉，这绛珠草始得久延岁月。【东观阁（姚燮）侧批：草无甘露岂能生乎？】后来既受天地精华，复得甘露滋养，遂脱了草木之胎，幻化人形，仅仅修成女体，终日游于‘离恨天’外，饥餐‘秘情果’，渴饮‘灌愁水’。【东观阁侧批：字栝得全书。】【姚燮侧批：括全书。】只因尚未酬报灌溉之德，故甚至五内郁结着一段缠绵不尽之意，常说：‘自己受了他雨露之惠，我并无此水可还；他若下世为人，我也同去走一遭，但把我一生所有的眼泪还他，【东观阁侧批：下泪之说甚奇，然天下情至不可解处，非下泪不足以极其缠绵固结之情也。卷中林黛玉自是可人，泪一日不下，则黛玉尚在，泪既干枯，黛玉亦物化矣。】【姚燮侧批：则此书亦可名为《还泪记》。】【陈其泰：可见除却宝玉，黛玉都非正传，宝钗不得与黛玉并论也。】也还得过了！’因此一事，就勾出多少风流冤家都要下凡，造历幻缘。那绛珠仙草也在其中。今日这石正该下世，我来特地将他仍带到警幻仙子案前，给他挂了号，同这些情鬼下凡一了此案。” 那道人说：“果是好笑；从来不闻有还泪之哦说。趁此你我何不也下世度脱几个，岂不是一场功德！”那僧道：“正合吾意，你且同我到警幻仙子宫中，将蠢物交割清楚，待这一干风流孽鬼下世已完，你我再去。如今虽已有一半落尘，然犹未全集。”道人道：“既如此，便随你去来。” 却说甄士隐俱听得明白，但不知所云“蠢物”系何东西。遂不禁上前施礼，笑问道：“二仙师请了。”那僧道也忙答礼相问。士隐因说道：“适闻仙师所谈因果，实人世罕闻者。但弟子愚浊，不能洞悉明白，若蒙大开痴顽，备细一闻，弟子则洗耳谛听，稍能警省，亦可免沉伦之苦。”二仙笑道：“此乃玄机不可预泄者。到那时不要忘我二人，便可跳出火坑矣。”士隐听了，不便再问。因笑道：“玄机不可预泄，但适云‘蠢物’，不知为何，或可一见否？”【姚燮眉批：上云倒也是个灵物了，而此处则云蠢物，灵有所蔽，故蠢也，后来因迷而悟，则蠢者复灵矣。】那僧道：“若问此物，倒有一面之缘。”说着，取出递与士隐。士隐接了看时，原来是块鲜明美玉，上面字迹分明，镌着“通灵宝玉”四字，后面还有几行小字。正欲细看时，那僧便说已到幻境，【东观阁侧批：指点语。】便强从手中夺了去，与道人竟过一大石牌坊，上书四个大字，乃是“太虚幻境”。【东观阁（姚燮）侧批：微旨。】两边又有一幅对联，道是： 假作真时真亦假， 无为有处有还无。【东观阁（姚燮）侧批：包括一切身相、人相、我相、寿者相。】【张新之夹批：历评此二语者以为打破禅关矣，己为作者窃笑，殊不知乃实实道出作书主意也】 士隐意欲也跟了过去，方举步时，忽听一声霹雳，有若山崩地陷。士隐大叫一声，定睛一看，只见烈日炎炎，芭蕉冉冉，所梦之事便忘了大半。【姚燮（东观阁侧批：醒来光景，非悟撤人未易参透。）使必记得清楚，便不是梦了。】又见奶母正抱了英莲走来。士隐见女儿越发生得粉妆玉琢，乖觉可喜，便伸手接来，抱在怀内，斗他顽耍一回，又带至街前，看那过会的热闹。 方欲进来时，只见从那边来了一僧一道：【东观阁（姚燮）侧批：僧道第一次现身。】那僧则癞头跣脚，那道则跛足蓬头，疯疯癫癫，挥霍谈笑而至。及至到了他门前，看见士隐抱着英莲，那僧便大哭起来，又向士隐道：“施主，你把这有命无运、累及爹娘之物，【东观阁侧批：香菱终身尽此一语。】【姚燮侧批：有命无运一语，不特为英莲言，也为全书总提。】抱在怀内作甚？”士隐听了，知是疯话，也不去睬他。那僧还说：“舍我罢，舍我罢！”士隐不耐烦，便抱女儿撤身要进去，那僧乃指着他大笑，口内念了四句言词道： 惯养娇生笑你痴，菱花空对雪澌澌。 好防佳节元宵后，便是烟消火灭时。 士隐听得明白，心下犹豫，意欲问他们来历。只听道人说道：“你我不必同行，就此分手，各干营生去罢。三劫后，我在北邙山等你，会齐了同往太虚幻境销号。”【东观阁（姚燮）侧批：语甚荒诞，而有微旨。】那僧道：“最妙，最妙！”说毕，二人一去，再不见个踪影了。士隐心中此时自忖：这两个人必有来历，该试一问，如今悔却晚也。 这士隐正痴想，忽见隔壁葫芦庙内寄居的一个穷儒──姓贾名化、表字时飞、别号雨村者【姚燮（东观阁）侧批：穷儒（贾）雨村初见。】走了出来。这贾雨村原系胡州人氏，也是诗书仕宦之族，因他生于末世，父母祖宗根基已尽，人口衰丧，只剩得他一身一口，在家乡无益，因进京求取功名，再整基业。自前岁来此，又淹蹇住了，暂寄庙中安身，每日卖字作文为生，故士隐常与他交接。 当下雨村见了士隐，忙施礼陪笑道：“老先生倚门伫望，敢是街市上有甚新闻否？”士隐笑道：“非也。适因小女啼哭，引他出来作耍，正是无聊之甚，兄来得正妙，请入小斋一谈，彼此皆可消此永昼。”说着，便令人送女儿进去，自与雨村携手来至书房中。【黄小田夹批：此不过欲雨村见娇杏耳，乃文章脱卸法。】小童献茶。方谈得三五句话，忽家人飞报：“严老爷来拜。”士隐慌的忙起身谢罪道：“恕诳驾之罪，略坐，弟即来陪。”雨村忙起身亦让道：“老先生请便。晚生乃常造之客，稍候何妨。”说着，士隐已出前厅去了。 这里雨村且翻弄书籍解闷。忽听得窗外有女子嗽声，雨村遂起身往窗外一看，原来是一个丫鬟，在那里撷花，生得仪容不俗，眉目清明，【陈其泰：有一部大情缘文字，先着此一段小小情缘，以作映照。此正世俗之所谓情也。】虽无十分姿色，却亦有动人之处。雨村不觉看的呆了。【东观阁侧批：已定姻缘。】【姚燮侧批：一个中人之姿，一看便呆，是姻缘凑拍处，不得与情人眼里一例观也。】【张新之夹批：通部演“财”“色”二字，此处自当略一点逗。】 那甄家丫鬟撷了花，方欲走时，猛抬头见窗内有人，敝巾旧服，虽是贫窘，然生得腰圆背厚，面阔口方，更兼剑眉星眼，直鼻权腮。这丫鬟忙转身回避，心下乃想：“这人生的这样雄壮，却又这样褴褛，想他定是我家主人常说的什么贾雨村了，每有意帮助周济，只是没甚机会。我家并无这样贫窘亲友，想定是此人无疑了。怪道又说他必非久困之人。”如此想来，不免又回头两次。雨村见他回了头，便自为这女子心中有意于他，【东观阁侧批（姚燮眉批）：两厢情愿。】【姚燮侧批：先生况久鳏乎？】便狂喜不尽，自为此女子必是个巨眼英雄，风尘中之知己也。一时小童进来，雨村打听得前面留饭，不可久待，遂从夹道中自便出门去了。【姚燮夹批：二人根情已种，可以将雨村脱卸去矣。】士隐待客既散，知雨村自便，也不去再邀。一日，早又中秋佳节。士隐家宴已毕，乃又另具一席于书房，却自己步月至庙中来邀雨村。原来雨村自那日见了甄家之婢曾回顾他两次，自为是个知己，便时刻放在心上。今又正值中秋，不免对月有怀，因而口占五言一律云： 未卜三生愿，频添一段愁。 闷来时敛额，行去几回头。 自顾风前影，谁堪月下俦？ 蟾光如有意，先上玉人楼。 雨村吟罢，因又思及平生抱负，苦未逢时，乃又搔首对天长叹，复高吟一联曰： 玉在椟中求善价，钗于奁内待时飞。【张新之夹批：此一联钗玉并举，最妙在一“求”字，一“待”字。】【陈其泰：此二字正映林薛之名。】 恰值士隐走来听见，笑道：“雨村兄真抱负不浅也！”【东观阁侧批：另（甄）贾竟成知己。】【姚燮侧批：二人已成知己。】雨村忙笑道：“不过偶吟前人之句，何敢狂诞至此。”因问：“老先生何兴至此？”士隐笑道：“今夜中秋，俗谓‘团圆之节’，想尊兄旅寄僧房，不无寂寥之感，故特具小酌，邀兄到敝斋一饮，不知可纳芹意否？”雨村听了，并不推辞，便笑道：“既蒙厚爱，何敢拂此盛情。”说着，便同士隐复过这边书院中来。须臾茶毕，早已设下杯盘，那美酒佳肴自不必说。二人归坐，先是款斟漫饮，次渐谈至兴浓，不觉飞觥限�衅鹄础５笔苯址簧霞壹殷锕埽�户户弦歌，当头一轮明月，飞彩凝辉，【姚燮夹批：点缀时景已不可少】二人愈添豪兴，酒到杯干。雨村此时已有七八分酒意，狂兴不禁，乃对月寓怀，口号一绝【东观阁侧批：雨村诗兴甚豪，必有呼为才子者。】【姚燮侧批：诗尚豪。】云： 时逢三五便团圆，满把晴光护玉栏。 天上一轮才捧出，人间万姓仰头看。【东观阁（姚燮）侧批：占口气。】 士隐听了，大叫：“妙哉！吾每谓兄必非久居人下者，今所吟之句，飞腾之兆已见，不日可接履于云霓之上矣。可贺，可贺！”乃亲斟一斗为贺。雨村因干过，叹道：“非晚生酒后狂言，若论时尚之学，晚生也或可去充数沽名，【姚燮（东观阁）侧批：有自知之（明），然则雨村亦是时尚之学矣。】只是目今行囊路费一概无措，神京路远，非赖卖字撰文即能到者。”士隐不待说完，便道：“兄何不早言。愚每有此心，但每遇兄时，兄并未谈及，愚故未敢唐突。今既及此，愚虽不才，‘义利’二字却还识得。且喜明岁正当大比，兄宜作速入都，春闱一战，方不负兄之所学也。其盘费馀事，弟自代为处置，亦不枉兄之谬识矣！”当下即命小童进去，速封五十两白银，【姚燮夹批：即一“速”字写出士隐慷慨。】并两套冬衣。又云：“十九日乃黄道之期，兄可即买舟西上，【张新之夹批：十成数，九阳数，十除九为一，一则吉，故真劝行而假不应。此书凡有明着日期处，皆有意义。】待雄飞高举，明冬再晤，岂非大快之事耶！”雨村收了银衣，不过略谢一语，并不介意，仍是吃酒谈笑。那天已交了三更，二人方散。 士隐送雨村去后，回房一觉，直至红日三竿方醒。因思昨夜之事，意欲再写两封荐书与雨村带至神都，使雨村投谒个仕宦之家为寄足之地。因使人过去请时，那家人去了回来说：“和尚说，贾爷今日五鼓已进京去了，也曾留下话与和尚转达老爷，说‘读书人不在黄道黑道，总以事理为要，【东观阁侧批：雨村此话真无此时俗之态。】【姚燮侧批：此语无时俗态。】【姚燮眉批：达人之见。】不及面辞了。’”【张新之夹批：如此故知作者特以矛盾自喜也。】士隐听了，也只得罢了。 真是闲处光阴易过，倏忽又是元宵佳节矣。士隐命家人霍启【张新之夹批：书中人名借音者俱类此。】抱了英莲去看社火花灯，半夜中，霍启因要小解，便将英莲放在一家门槛上坐着。待他小解完了来抱时，那有英莲的踪影？【东观阁（姚燮）侧批：和尚之言已验。】急得霍启直寻了半夜，至天明不见，那霍启也就不敢回来见主人，便逃往他乡去了。那士隐夫妇，见女儿一夜不归，便知有些不妥，再使几人去寻找，回来皆云连音响皆无。夫妻二人，半世只生此女，一旦失落，岂不思想，因此昼夜啼哭，几乎不曾寻死。看看的一月，士隐先就得了一病，当时封氏孺人也因思女构疾，日日请医疗治。 不想这日三月十五，葫芦庙中炸供，那些和尚不加小心，致使油锅火逸，便烧着窗纸。此方人家多用竹篱木壁者，大抵也因劫数，【东观阁（姚燮）侧批：和尚之言又验。】于是接二连三，牵五挂四，将一条街烧得如火焰山一般。彼时虽有军民来救，那火已成了势，如何救得下？直烧了一夜，方渐渐的熄去，也不知烧了几家。只可怜甄家在隔壁，早已烧成一片瓦砾场了。只有他夫妇并几个家人的性命不曾伤了。急得士隐惟跌足长叹而已。只得与妻子商议，且到田庄上去安身。偏值近年水旱不收，鼠盗蜂起，无非抢田夺地，鼠窃狗偷，民不安生，因此官兵剿捕，难以安身。士隐只得将田庄都折变了，便携了妻子与两个丫鬟投他岳丈家去。 他岳丈名唤封肃，本贯大如州人氏，虽是务农，家中都还殷实。今见女婿这等狼狈而来，心中便有些不乐。【东观阁侧批：人情如此。】【姚燮侧批：人情世态比比皆然。】幸而士隐还有折变田地的银子未曾用完，拿出来托他随分就价薄置些须房地，为后日衣食之计。那封肃便半哄半赚，略与他些薄田破屋。【东观阁侧批：人心难测，翁�僦�间亦如是乎！】【姚燮侧批：自己丈人尚如此，可为世道一叹。】士隐乃读书之人，不惯生理稼穑等事，勉强支持了一二年，越觉穷了下去。封肃每见面时，便说些现成话，且人前人后又怨他们不善过活，只一味好吃懒作等语。士隐知投人不着，心中未免悔恨，再兼上年惊唬，急忿怨痛，已有积伤，暮年之人，贫病交攻，竟渐渐的露出那下世的光景来。 可巧这日拄了拐杖挣挫到街前散散心时，忽见那边来了一个跛足道人，【姚燮（东观阁）侧批：又来了一个跛（足）道人。】疯癫落脱，麻屣鹑衣，口内念着几句言词，道是： 世人都晓神仙好，惟有功名忘不了！ 古今将相在何方？荒冢一堆草没了。世人都晓神仙好，只有金银忘不了！ 终朝只恨聚无多，及到多时眼闭了。 世人都晓神仙好，只有姣妻忘不了！ 君生日日说恩情，君死又随人去了。 世人都晓神仙好，只有儿孙忘不了！ 痴心父母古来多，孝顺儿孙谁见了？【东观阁侧批：语浅意深。】【姚燮侧批：词浅意深。】 士隐听了，便迎上来道：“你满口说些什么？只听见些‘好’‘了’‘好’‘了’。”那道人笑道：“你若果听见‘好’‘了’二字，还算你明白。可知世上万般，好便是了，了便是好。若不了，便不好；若要好，须是了。【东观阁侧批：醒世语，却以禅机出之，令人猛省。】【姚燮眉批：天下事无好而不了者，此言大有禅意。】我这歌儿，便名《好了歌》”士隐本是有宿慧的，一闻此言，心中早已彻悟。因笑道：“且住！待我将你这《好了歌》解注出来何如？”道人笑道：“你解，你解。”士隐乃说道： 陋室空堂，当年笏满床，衰草枯杨，曾为歌舞场。 蛛丝儿结满雕梁，绿纱今又糊在蓬窗上。 说什么脂正浓，粉正香，如何两鬓又成霜？ 昨日黄土陇头送白骨，【姚燮眉批：本来今日之红梢帐底即他日之黄土陇头，今反以黄土句装在前，觉尤进一层，以见白骨自堆，鸳鸯自卧也。请于热闹时读一过。】 今宵红灯帐底卧鸳鸯。 金满箱，银满箱，展眼乞丐人皆谤。 正叹他人命不长，那知自己归来丧！训有方，保不定日后作强梁。 择膏粱，谁承望流落在烟花巷！因嫌纱帽小，致使锁枷杠； 昨怜破袄寒，今嫌紫蟒长：乱烘烘你方唱罢我登场， 反认他乡是故乡。甚荒唐，到头来都是为他人作嫁衣裳！【东观阁侧批：热闹人日读一过何如？】【姚燮眉批：请于热闹时读一过。】【黄小田夹批：此篇与上“好了歌”皆作书本旨。】 那疯跛道人听了，拍掌笑道：“解得切，解得切！”士隐便说一声“走罢！”将道人肩上褡裢抢了过来背着，竟不回家，同了疯道人飘飘而去。【姚燮（东观阁侧批：士隐果决，一丝不挂，可以入道，）自是真“好”、“了”矣！】当下烘动街坊，众人当作一件新闻传说。封氏闻得此信，哭个死去活来，只得与父亲商议，遣人各处访寻，那讨音信？无奈何，少不得依靠着他父母度日。幸而身边还有两个旧日的丫鬟伏侍，主仆三人，日夜作些针线发卖，帮着父亲用度。那封肃虽然日日抱怨，也无可奈何了。 这日，那甄家大丫鬟在门前买线，忽听街上喝道之声，众人都说新太爷到任。丫鬟于是隐在门内看时，只见军牢快手，一对一对的过去，俄而大轿抬着一个乌帽猩袍的官府过去。丫鬟倒发了个怔，自思这官好面善，倒像在那里见过的。【东观阁（姚燮）侧批：红鸾天喜照命。】于是进入房中，也就丢过不在心上。至晚间，正待歇息之时，忽听一片声打的门响，许多人乱嚷，说：“本府太爷差人来传人问话。”封肃听了，唬得目瞪口呆，不知有何祸事。 【陈其泰：以真事隐假语村言作起，以真事隐假语村言作末回归结，手笔超妙。 作书本旨，欲脱尽陈言，独标新义。开卷一回，戛戛独造，引人入胜。文心绝世。女娲炼石补天处，石破天惊逗秋雨。文境如是，不识看书者能点头否耶？ 若金玉姻缘之说，信而有征。何以总冒处叙通灵缘起，绝无一字提及金锁耶？宝钗伪造金锁，倡金玉之说以惑人，显然可见。】【涂瀛：涂铁纶曰：性情嗜好之不同，如其面焉。尧舜不能强巢许为功名，犹巢许不能强尧舜为隐逸也。但能各宝其宝，各玉其玉，斯不免耳。然世俗之见，往往以经济文章为真宝玉，而以风花雪月为假宝玉。岂知经济文章，不本于性情，由此便生出许多不可问不可耐之事；转不若风花雪月，任其本色，犹得保其不雕不凿之天。然此风花雪月之情，可为知者道，难为俗人言。故不得不仍世俗之见，而以经济文章属之真，以风花雪月属之假。意其初必有一人如甄宝玉者，与贾宝玉缔交。其性情嗜好，大抵相同；而其后为经济文章所染，将本来面目一朝改尽，做出许多不可问、不可耐之事，而世且艳之羡之。其为风花雪月者，乃时时为人指摘，用为口实。贾宝玉伤之，故将真事隐去，借假语村言演出此书，为自己解嘲，而亦兼哭其友也。故写贾宝玉种种越人，而于断制处从无褒语，盖自嫌也。写甄宝玉初用贬词，嫌其与己同；后用褒语，明其与己异也。然则作书之意，断可识已。而世人乃谓讥贾宝玉而作。夫宝玉在所讥矣，而乃费如许狮子搏象神力，为斯人撰，一开天辟地绝无仅有之文，使斯人亦为开天辟地绝无仅有之人，是讥之实寿之也。其孰不求讥于子？吾以知《红楼梦》之作，宝玉自况也。】【哈斯宝：这一回有七桩事：作者写出自己意向，这是一段；顽石遇僧道，又是一段；甄士隐作梦，是一桩；他遇见僧道，是一桩；贾雨村看见婢女，是一桩；他赴京，是一桩；加上甄士隐家遭火灾，落发为僧，一共七桩。这七段分开来，各自都有深奥重大的原由，但是一口气读下去，却象连贯的一整段，这里有作者小小的才华。 文章有主客之法。甄士隐、贾雨村，是全四十回的大客。甄士隐，就是“真事引”，又可释为“真士隐”。贾雨村，就是“村假语”，又可释为“假语存”。以真事作引子，理当一提就过去，所以倏忽即逝，立即隐去。村中假语，一开始就该绵绵长续，所以接续不断说下去。真假不可并存，便把甄士隐搁置一边，来写贾雨村。这两人是后文中甄贾两大世家的客身。全四十回的大纲便是真假二字。真，内热而外冷。假，外热而内冷。故开头都是冷，无一丝热处。后来贾家父子诸兄弟一出场，便写得炽热，一点冷也没有了。但是假的终究不长远，最后一但返冷，便落得个破瓯碎罐一般。 葫芦庙是一奇。它真是以地形为名的？我看勿宁说以它的名字来描述地形。一开卷就是葫芦庙，这正是不知他葫芦里卖的什么药的时候。读者不要被他骗过了。 此书始于一梦，以一睡收场，这值得看官思量。 文章有穿针引线之法。贾雨村月下吟诵一联：“玉在改中求善价，钗于奋内待时飞”，这是一整套情节的枢纽。玉是黛玉，钗是宝钗，全书故事写的都是这两人。“求善价”就是《四书》上说的“美玉待善价而沽”。“待时飞”，雨村的字不正是时飞么？要想知道宝钗的故事，必须等待由雨村的事里引出，所以说“待时飞”。这便是网罗全书的情节，在此处提纲挈领，总揽一笔。在平平常常的一句话里就藏有如此硕大的机关，可见作者胸怀如何。若不细加品味，把它仅仅当作一句雨村抒怀之语，便是空放过了。 为避笔墨烦冗，在贾雨村看见娇杏之前安排了一句“严老爷来拜”，把甄士隐支出去。佳节之夜失火之前，丢了英莲的家人名叫霍启。这些人名都是随事信手写出的，岂不很妙？此类笔法，后文屡见，应当不语自明。 写这部书，不仅写了形形色色的人的性情，而且暗射了天时。看官请看，书中开始是暖，中间热，继而生凉，最后是寒，以天时比喻人的性情，怎会不写得琳漓尽致？】`;
		this.index = 0;
	}

	hasMore(): boolean {
		return this.index < this.longText.length - 1;
	}

	nextChar(): string {
		return this.longText[this.index++];
	}

	giveBack(remarks: string[] = []) {

		if (remarks && remarks.length > 0) {

			for (let remark of remarks) {
				this.index -= remark.length + 2;
			}
		}
		else {

			if (this.index > 0) {
				this.index--;
			}
		}
	}

	retrieveRemarks(): string[] {

		let remarks: string[] = [];

		while (this.longText[this.index] == '【') {

			let endPosition = this.longText.indexOf('】', this.index + 1);
			if (endPosition < 0) break;

			let remark = this.longText.substring(this.index + 1, endPosition);

			remarks.push(remark);
			this.index = endPosition + 1;
		}

		return remarks;
	}

	static beginningInappropriate(c): boolean {
		return ":,.?!)]：，。？！…、）】”』".indexOf(c) > -1;
	}

	static endingInappropriate(c): boolean {
		return "([（【『“".indexOf(c) > -1;
	}
}
