import {Injectable} from '@angular/core';
import {Http} from '@angular/http';
import 'rxjs/add/operator/map';

/*
 Generated class for the BookDataProvider provider.

 See https://angular.io/docs/ts/latest/guide/dependency-injection.html
 for more info on providers and Angular 2 DI.
 */
@Injectable()
export class BookDataProvider {

  longText: string;
  startIndex: number;

  constructor(public http: Http) {

    // TODO: load from storage & network

    this.longText = `少读《红楼梦》，喜其洋洋洒洒，浩无涯涣，其描绘人情，雕刻物态，真能抉肺腑而肖化工，以为文章之奇，莫奇于此矣，而未知其所以奇也。丙寅寓都门，得友人刘子重贻妙复轩《石头记》评本，逐句梳栉，细加排比，反复玩索，寻其义，究其归，如是者五年。乃旷然废书而叹曰：至矣哉！天下无一本之文固若是哉！文章者，性情之华也。性情不深者，文章必不能雄奇恣肆，犹根底不固者，枝叶必不畅茂条达也。世庸有苟作之文，持摭敷衍，支离失实，无底里可顾，无命意可求，非竭则萎，乌斯斯爱而斯传哉?盖立言不根理要，既不能发挥古今之名理，焉能餍饫乎天下之人心?事有必然无疑者，然作者难，识者不易。自得妙复轩评本，然后知是书之所以传，传以奇，是书之所以奇，实奇而正也。如含玉而生，实演明德；黛为物欲，实演自新。此外融会四子六经，以俗情道文言，或用借音，或用设影，或以反笔达正意，或以前言击后语。尤奇者，教养常经也，转托凿致祸蔑伦之口；仙释借径也，实隐辟异端曲学之非。就其涉，可以化愚蒙；而极其深，可以困贤智。本谈情之旨，以尽复性之功，彻上彻下，不独为中人以下说法也。至其立忠孝之纲，存人禽之辨，主以阴阳五行，寓以劝惩褒贬，深心大义，于海涵地负中自有万变不移、一蝗不紊之主宰，信乎其为奇传也。奇而不究于正，惟能照风月宝鉴反面者，乃能善用其奇也。是书之作，六十年来，无真能读、真能解者，甚有耳食目为淫书，亦大负作者立言救世苦心矣。得太平闲人发其聩，振其聋，俾书中奥义微言，昭然若揭，范围曲成，人伦日用，随地可以自尽。善乎其注文妙真人也曰：“人之所以妙，妙在真，能真，斯为人而不为兽。”即此数言，可括《石头》全部。惟作者姓名不传，访诸故老，或以为书为近代明相而作，宝玉为纳兰容若。以时事文集证之或不谬。其曰珠曰瑞，又移易其辈行而错综之。若贾雨村，即高江村也。高以诸生，觅馆入都，主于明仆，由是进身致通显。若平安州则保定府之别名，李御史即郭华野之易姓，而特以真事既隐，正令人寻踪按迹而无从。盖作文之妙，在缥缈虚无间，使人可望不可即，乃有馀味。若一征诸实，则刘四骂人，语多避忌，而口诛笔伐，亦不能畅所欲言矣。篇后有曹雪芹删定数过云云，曹雪芹或以即曹银台寅之公子，其胡老明公三子也。考其时，假馆容若，擅宏通、称莫逆者，则有梁药亭、姜西溟、顾梁汾诸君子，不能实指为某人草创，某人润色也。至书中言宝玉中第七名举人，查进士题名碑，成德中康熙十五年丙辰科二甲第七名进士，言举人者，隐之也。又按顾梁汾《弹指词&#8226;金缕曲》后注云：“岁丙辰，容若年二十二，一见予，即恨相见晚，填词见赠，有‘后身缘恐结它生里’，极感其意，而殊讶为不祥。后竟卒于乙丑五月，谶语果符。”是容若得年三十有一耳。考时代暨书中事迹，信为演容若也无疑。他若太平闲人为仝君卜年，评本并未注名，亦无别号，不佞冥搜苦索于意言之表得之，因别号而实以人，何尝评者之借以为名也。评者不自为名，又何有于作者?是谓亘古绝今一大奇书也可。然能识奇书，评奇书，使天下后世皆知为奇书，不致以奇书为淫书，而误于奇书，则太平闲人亦一天下之奇人也已。 同治癸酉季秋月下浣饮真外史孙桐生叙于卧云山馆。`;

    this.startIndex = 0;
  }
}
